benchmarks/results/k6-20.log

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: /Users/guerqian77/Documents/Codex/2026-09-21/new-chat/outputs/labops-erp/benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 20 VUs  00.1s/30s

running (0m03.0s), 20/20 VUs, 18 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  01.1s/30s

running (0m04.0s), 20/20 VUs, 36 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  02.1s/30s

running (0m05.0s), 20/20 VUs, 57 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  03.1s/30s

running (0m06.0s), 20/20 VUs, 85 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  04.1s/30s

running (0m07.0s), 20/20 VUs, 108 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  05.1s/30s

running (0m08.0s), 20/20 VUs, 127 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  06.1s/30s

running (0m09.0s), 20/20 VUs, 143 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  07.1s/30s

running (0m10.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  08.1s/30s

running (0m11.0s), 20/20 VUs, 176 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  09.1s/30s

running (0m12.0s), 20/20 VUs, 189 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  10.1s/30s

running (0m13.0s), 20/20 VUs, 205 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  11.1s/30s

running (0m14.0s), 20/20 VUs, 228 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  12.1s/30s

running (0m15.0s), 20/20 VUs, 253 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  13.1s/30s

running (0m16.0s), 20/20 VUs, 272 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  14.1s/30s

running (0m17.0s), 20/20 VUs, 297 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  15.1s/30s

running (0m18.0s), 20/20 VUs, 317 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  16.1s/30s

running (0m19.0s), 20/20 VUs, 336 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  17.1s/30s

running (0m20.0s), 20/20 VUs, 355 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  18.1s/30s

running (0m21.0s), 20/20 VUs, 375 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  19.1s/30s

running (0m22.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  20.1s/30s

running (0m23.0s), 20/20 VUs, 423 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  21.1s/30s

running (0m24.0s), 20/20 VUs, 440 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  22.1s/30s

running (0m25.0s), 20/20 VUs, 451 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  23.1s/30s

running (0m26.0s), 20/20 VUs, 466 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  24.1s/30s

running (0m27.0s), 20/20 VUs, 471 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  25.1s/30s

running (0m28.0s), 20/20 VUs, 484 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  26.1s/30s

running (0m29.0s), 20/20 VUs, 506 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  27.1s/30s

running (0m30.0s), 20/20 VUs, 525 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  28.1s/30s

running (0m31.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  29.1s/30s

running (0m32.0s), 14/20 VUs, 576 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  30s


  █ THRESHOLDS

    business_failures
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 748     22.94548/s
    checks_succeeded...: 100.00% 748 out of 748
    checks_failed......: 0.00%   0 out of 748

    ✓ inventory ok
    ✓ POST request accepted
    ✓ POST receipt accepted
    ✓ POST submit accepted
    ✓ POST approval accepted
    ✓ POST receipt posting accepted
    ✓ POST issue accepted
    ✓ reports ok

    CUSTOM
    business_failures..............: 0.00%  0 out of 748

    HTTP
    http_req_duration..............: avg=764.32ms p(50)=855.51ms p(95)=1.68s p(99)=2.31s max=2.79s
      { expected_response:true }...: avg=764.32ms p(50)=855.51ms p(95)=1.68s p(99)=2.31s max=2.79s
    http_req_failed................: 0.00%  0 out of 756
    http_reqs......................: 756    23.190886/s

    EXECUTION
    iteration_duration.............: avg=1.02s    p(50)=933.04ms p(95)=3.06s p(99)=4.01s max=5.35s
    iterations.....................: 590    18.098707/s
    vus............................: 14     min=0        max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 4.4 MB 136 kB/s
    data_sent......................: 288 kB 8.8 kB/s



running (0m32.6s), 00/20 VUs, 590 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  30s